upstream/OpenFOAM-v2606/modules/OpenQBMM/tutorials/compressiblePbeTransportFoam/twentyThreeDegreeWedge/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel univariate;

univariateCoeffs
{
    diffusionModel
    {
        diffusionModel  turbulentDiffusion;
        gammaLam        gammaLam    [ 0 2 -1 0 0 0 0 ] 1.0e-6;
        Sc              0.7;
    }

    aggregation on;

    aggregationKernel
    {
        aggregationKernel turbulentBrownian;
    }

    breakup on;

    breakupKernel
    {
        breakupKernel LuoSvendsen;

        Cb        Cb        [ 0 0 0 0 0 0 0 ] 0.2;
        epsilonExp          0.75;
        nuExp              -1.25;
        sizeExp             1.0;

        daughterDistribution
        {
            daughterDistribution symmetricFragmentation;
        }
    }

    growth off;

    growthModel
    {
        growthModel	constant;
        minAbscissa     minAbscissa [0 -2 0 0 0 0 0] 0.0;
        maxAbscissa     maxAbscissa [0 -2 0 0 0 0 0] 1.0;

        Cg        Cg        [0 3 -1 0 0 0 0 ] 1.0;
    }

    nucleationModel
    {
        nucleationModel  none;
    }

    odeCoeffs
    {
        solveOde on;
        ATol    1.0e-6;
        RTol    1.0e-3;
        fac     0.9;
        facMin  0.1;
        facMax  10.0;
        minLocalDt 1.0e-10;
    }
}





// ************************************************************************* //
